This is an exercise based off of https://github.com/GokuMohandas/Made-With-ML/blob/4ad626098aca25db5628fe67895e738d5a5c2c2a/notebooks/03_Pandas.ipynb

In [1]:
import urllib

In [4]:
# Upload github data to notebook
url = "https://raw.githubusercontent.com/GokuMohandas/Made-With-ML/main/datasets/titanic.csv"
response = urllib.request.urlopen(url)
html = response.read()

with open('titanic.csv', 'wb') as f:
    f.write(html)

In [10]:
!ls -1

03_pandas.ipynb
DataScience1.ipynb
data.csv
myfirstnotebook.ipynb
titanic.csv

In [11]:
import pandas as pd

In [17]:
# Read CSV into Pandas Data Frame
df = pd.read_csv('titanic.csv', header=0)

# First five items
df.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,1
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,0